uhnp/src/Reports/ПлатежныйКалендарьУХ/ПлатежныйКалендарьУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарьУХ</name>
  <comment>(-УХ)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОстаткиСУчетомОвердрафтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоступленияПередСписаниями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьНеуправляемыеСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритетуПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСуммеПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийСтрессТестированияЛиквидности</name>
    <type>
      <types>CatalogRef.СценарииСтрессТестированияЛиквидности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДиаграмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтОперативногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаТаблицыОстатковИОборотов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМакетаОформления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтбораПросроченныхЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПереводаМеждуСчетами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссииПриКонвертацииВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СущественнаяРазницаСтоимостиКредитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДанныеВВалютеОтображения</name>
    <comment>Выводить данные календаря в валюте отображения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкиОтчета</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтТактическогоПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОперативногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоКассовыеРазрывы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.ВариантыПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВходящихОстатков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСобытияФормированияОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыводаОборотов</name>
    <type>
      <types>EnumRef.РежимыВыводаОборотовПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаЭкстраполяцииДенежныхПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДолгосрочногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДолгосрочногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныхДоговоров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДоверительныеКоэффициентыПриПланированииПоступлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБазоваяФункциональность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовОптимизации</name>
    <attributes>
      <name>ВариантОптимизации</name>
      <type>
        <types>EnumRef.ВариантыОптимизацииПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/Enums/ИсточникиДанныхПлатежногоКалендаря/ИсточникиДанныхПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиДанныхПлатежногоКалендаря</name>
  <enumValues>
    <name>ЗаявкиУтвержденные</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиНеутвержденные</name>
  </enumValues>
  <enumValues>
    <name>РезервУтвержденный</name>
  </enumValues>
  <enumValues>
    <name>ДанныеБюджетирования</name>
  </enumValues>
  <enumValues>
    <name>ПрогнозДенежныхПотоков</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/ПлатежныйКалендарьУХ/Forms/ФормаВыбораИсточниковДанных/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсточникиДанных.Загрузить(Параметры.ИсточникиДанных.Выгрузить()); 
	СортироватьИсточникиДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда 
		ТекстПредупреждения = НСтр("ru = 'Данные были изменены, внесенные изменения будут отменены.
										 |Отменить и закрыть?'");
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(
					ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ДействиеВыбрано");
	КонецЕсли;
КонецПроцедуры
	  
#КонецОбласти	  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	ДействиеВыбрано = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)  
	ДействиеВыбрано = Истина;
	Закрыть(ПоместитьВоВременноеХранилищеИсточникиДанных(ИсточникиДанных));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьЗначенияФлажков(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьЗначенияФлажков(Ложь);
КонецПроцедуры

#КонецОбласти	  
	  
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПоместитьВоВременноеХранилищеИсточникиДанных(Знач ИсточникиДанных)
	
	Возврат ПоместитьВоВременноеХранилище(ИсточникиДанных.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначенияФлажков(ЗначениеФлажка)
	
	Для Каждого СтрокаТаблицы Из ИсточникиДанных Цикл   
		СтрокаТаблицы.Поступления = ЗначениеФлажка;	
		СтрокаТаблицы.Списания = ЗначениеФлажка;	
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СортироватьИсточникиДанных()
	
	Для Каждого СтрокаТаблицы Из ИсточникиДанных Цикл 
		СтрокаТаблицы.Порядок = ПорядокИсточникаДанных(СтрокаТаблицы.ИсточникДанных);	
	КонецЦикла;
	
	ИсточникиДанных.Сортировать("Порядок");

КонецПроцедуры

&НаСервере
Функция ПорядокИсточникаДанных(ИсточникДанных) 
	
	Порядки = Новый Соответствие;
	Порядки.Вставить(Перечисления.ИсточникиДанныхПлатежногоКалендаря.ЗаявкиУтвержденные, 1);
	Порядки.Вставить(Перечисления.ИсточникиДанныхПлатежногоКалендаря.ЗаявкиНеутвержденные, 2);
	Порядки.Вставить(Перечисления.ИсточникиДанныхПлатежногоКалендаря.РезервУтвержденный, 3);
	Порядки.Вставить(Перечисления.ИсточникиДанныхПлатежногоКалендаря.ДанныеБюджетирования, 4);
	Порядки.Вставить(Перечисления.ИсточникиДанныхПлатежногоКалендаря.ПрогнозДенежныхПотоков, 5);
	
	Возврат Порядки.Получить(ИсточникДанных);
	
КонецФункции

#КонецОбласти
